<?php
	//九九乘法表
    echo '乘法表'.'<br>';
    function arr($num)
    {
        $a = '';
        for ($i = 1; $i <= $num; $i++) {
            for ($j = 1; $j <= $i; $j++) {
                $a .= $j . 'X' . $i . '=' . ($i * $j) . ' ';
                if ($j == $i) {
                    $a.= '<br>';
                }
            }
        }
        return $a;
    }
    echo arr(9);
    echo "=============================================================================================".'<br>';
    //冒泡排序
    echo '冒泡排序'.'<br>';
    function mp($arr=array())
    {
        $num = count($arr);
        for ($i = 0; $i < $num; $i++) {
            for ($j = 0; $j < $num; $j++) {
                if ($arr[$i] < $arr[$j]) {
                    $num1 = $arr[$i];
                    $arr[$i] = $arr[$j];
                    $arr[$j] = $num1;
                }
            }
        }
        return $arr;
    }
    $arr = [7,2,3,6,5,8,4,9,1,0];
    print_r($arr);
    echo '<br>';
    print_r(mp($arr));

    echo "=============================================================================================".'<br>';
    //快速排序
    echo '快速排序'.'<br>';
    $arr = [7,2,3,6,5,8,4,9,1,0];
?>